[{"Fact":"there are more than 3,000 species of snakes on the planet and they’re found everywhere except in Antarctica, Iceland, Ireland, Greenland, and New Zealand."},{"Fact":"Big pythons and boa snakes have traces of back legs left over from millions of years of evolution when snakes started out as land lizards."},{"Fact":"It can take a snake up to five days to digest its last meal. With bigger snakes like an anaconda, that digestion period is weeks rather than days."},{"Fact":"Record holder for biggest variety of snake goes to the anaconda. It can top out at 595 pounds (270kg) and stretch out to 30 feet (9 meters)."},{"Fact":"Anacondas have been known to snack on Jaguars."},{"Fact":"Snakes don’t have ears on the outside. Those internal ears pick up sound waves from its skin, muscles and bones."},{"Fact":"Snakes don’t have ears on the outside. Those internal ears pick up sound waves from its skin, muscles and bones."},{"Fact":"A rattlesnake’s rattle is made of the same stuff that makes human hair and fingernails. Every time a rattler sheds it skin, it grows a new rattling ring."},{"Fact":"f you were to open the mouth of a snake then you might be able to count off up to 200 teeth. They aren’t used for chewing but keeping what it just swallowed from crawling back out."},{"Fact":"There are five kinds of flying snakes that can take off and fly up to 330 feet (100 meters) in the air."},{"Fact":"A snake uses its forked tongue to smell. It can even smell in directions, kind of like smelling in stereo."},{"Fact":"The Mozambique spitting cobra is aptly named because of its ability to spit at distances up to 8 feet (2.5 meters). It tends to aim for the eyes."},{"Fact":"The biggest snake fossil was fifty feet long. That 60-million-year-old snake probably weighed as much as 20 people and could eat whole crocodiles."},{"Fact":"If a snake just ate and then feels threatened, it will regurgitate its meal. That way it can make a quick getaway."},{"Fact":"Vipers, pythons and boas have holes on their faces called pit organs, which contain a membrane that can detect infrared radiation from warm bodies up to one metre away."},{"Fact":"Snakes are cute."},{"Fact":"Snakes can go a really long time without food! In fact, ball pythons like me can go without food for up to 6 months!"}]