[
  {
    "Fact": "there are more than 3,000 species of snakes on the planet and they’re found everywhere except in Antarctica, Iceland, Ireland, Greenland, and New Zealand."
  },
  {
    "Fact": "Big pythons and boa snakes have traces of back legs left over from millions of years of evolution when snakes started out as land lizards."
  },
  {
    "Fact": "It can take a snake up to five days to digest its last meal. With bigger snakes like an anaconda, that digestion period is weeks rather than days."
  },
  {
    "Fact": "Record holder for biggest variety of snake goes to the anaconda. It can top out at 595 pounds (270kg) and stretch out to 30 feet (9 meters)."
  },
  {
    "Fact": "Anacondas have been known to snack on Jaguars."
  },
  {
    "Fact": "Snakes don’t have ears on the outside. Those internal ears pick up sound waves from its skin, muscles and bones."
  },
  {
    "Fact": "Snakes don’t have ears on the outside. Those internal ears pick up sound waves from its skin, muscles and bones."
  },
  {
    "Fact": "A rattlesnake’s rattle is made of the same stuff that makes human hair and fingernails. Every time a rattler sheds it skin, it grows a new rattling ring."
  },
  {
    "Fact": "f you were to open the mouth of a snake then you might be able to count off up to 200 teeth. They aren’t used for chewing but keeping what it just swallowed from crawling back out."
  },
  {
    "Fact": "There are five kinds of flying snakes that can take off and fly up to 330 feet (100 meters) in the air."
  },
  {
    "Fact": "A snake uses its forked tongue to smell. It can even smell in directions, kind of like smelling in stereo."
  },
  {
    "Fact": "The Mozambique spitting cobra is aptly named because of its ability to spit at distances up to 8 feet (2.5 meters). It tends to aim for the eyes."
  },
  {
    "Fact": "The biggest snake fossil was fifty feet long. That 60-million-year-old snake probably weighed as much as 20 people and could eat whole crocodiles."
  },
  {
    "Fact": "If a snake just ate and then feels threatened, it will regurgitate its meal. That way it can make a quick getaway."
  },
  {
    "Fact": "Vipers, pythons and boas have holes on their faces called pit organs, which contain a membrane that can detect infrared radiation from warm bodies up to one metre away."
  },
  {
    "Fact": "Snakes are cute."
  },
  {
    "Fact": "Snakes can go a really long time without food! In fact, ball pythons like me can go without food for up to 6 months!"
  },
  {
    "Fact": "The decapitated head of a dead snake can still bite, even hours after death. These types of bites usually contain huge amounts of venom."
  },
  {
    "Fact": "Sea snakes with their paddle-shaped tails can dive over 300 feet into the ocean."
  },
  {
    "Fact": "The world’s longest venomous snake is the king cobra from Asia. It can grow up to 18 feet, rear almost as high as a person, growl loudly, and inject enough venom to kill an elephant."
  },
  {
    "Fact": "The word “cobra” means “hooded.” Some cobras have large spots on the back of their hood that look like eyes to make them appear intimating even from behind."
  },
  {
    "Fact": "The black mamba is the world’s fastest snake and the world’s second-longest venomous snake in the world, after the king cobra. Found in East Africa, it can reach speeds of up to 12 mph (19kph). It’s named not from the color of its scales, which is olive green, but from the inside of its mouth, which is inky black. Its venom is highly toxic, and without anti-venom, death in humans usually occurs within 7–15 hours."
  },
  {
    "Fact": "While a snake cannot hear the music of a snake charmer, the snake responds to the vibrations of the charmer’s tapping foot or to the movement of the flute."
  },
  {
    "Fact": "Two-headed snakes are similar to conjoined twins: an embryo begins to split to create identical twins, but the process does not finish. Such snakes rarely survive in the wild because the two heads have duplicate senses, they fight over food, and one head may try to eat the other head."
  },
  {
    "Fact": "Approximately 70% of snakes lay eggs. Those that lay eggs are called oviparous. The other 30% of snakes live in colder climates and give birth to live young because it is too cold for eggs outside the body to develop and hatch."
  },
  {
    "Fact": "Snakes kill over 40,000 people a year—though, with unreported incidents, the total may be over 100,000. About half of these deaths are in India."
  },
  {
    "Fact": "Depending on the species, snakes can live from 4 to over 25 years."
  },
  {
    "Fact": "Two-headed snakes are not just mythical creatures – they can occur on rare occasions! Often the two heads will fight each other for food despite sharing the same body"
  },
  {
    "Fact": "There is an island in Brazil that has up to 5 snakes per square metre! People are not allowed to go to the island as it is the home of the golden lancehead snake which is critically endangered"
  }
]