[
  {
    "Fact": "there are more than 3,000 species of snakes on the planet and they’re found everywhere except in Antarctica, Iceland, Ireland, Greenland, and New Zealand."
  },
  {
    "Fact": "Big pythons and boa snakes have traces of back legs left over from millions of years of evolution when snakes started out as land lizards."
  },
  {
    "Fact": "It can take a snake up to five days to digest its last meal. With bigger snakes like an anaconda, that digestion period is weeks rather than days."
  },
  {
    "Fact": "Record holder for biggest variety of snake goes to the anaconda. It can top out at 595 pounds (270kg) and stretch out to 30 feet (9 meters)."
  },
  {
    "Fact": "Anacondas have been known to snack on Jaguars."
  },
  {
    "Fact": "Snakes don’t have ears on the outside. Those internal ears pick up sound waves from its skin, muscles and bones."
  },
  {
    "Fact": "Snakes don’t have ears on the outside. Those internal ears pick up sound waves from its skin, muscles and bones."
  },
  {
    "Fact": "A rattlesnake’s rattle is made of the same stuff that makes human hair and fingernails. Every time a rattler sheds it skin, it grows a new rattling ring."
  },
  {
    "Fact": "f you were to open the mouth of a snake then you might be able to count off up to 200 teeth. They aren’t used for chewing but keeping what it just swallowed from crawling back out."
  },
  {
    "Fact": "There are five kinds of flying snakes that can take off and fly up to 330 feet (100 meters) in the air."
  },
  {
    "Fact": "A snake uses its forked tongue to smell. It can even smell in directions, kind of like smelling in stereo."
  },
  {
    "Fact": "The Mozambique spitting cobra is aptly named because of its ability to spit at distances up to 8 feet (2.5 meters). It tends to aim for the eyes."
  },
  {
    "Fact": "The biggest snake fossil was fifty feet long. That 60-million-year-old snake probably weighed as much as 20 people and could eat whole crocodiles."
  },
  {
    "Fact": "If a snake just ate and then feels threatened, it will regurgitate its meal. That way it can make a quick getaway."
  },
  {
    "Fact": "Vipers, pythons and boas have holes on their faces called pit organs, which contain a membrane that can detect infrared radiation from warm bodies up to one metre away."
  },
  {
    "Fact": "Snakes are cute."
  },
  {
    "Fact": "Snakes can go a really long time without food! In fact, ball pythons like me can go without food for up to 6 months!"
  },
  {
    "Fact": "The decapitated head of a dead snake can still bite, even hours after death. These types of bites usually contain huge amounts of venom."
  },
  {
    "Fact": "Sea snakes with their paddle-shaped tails can dive over 300 feet into the ocean."
  },
  {
    "Fact": "The world’s longest venomous snake is the king cobra from Asia. It can grow up to 18 feet, rear almost as high as a person, growl loudly, and inject enough venom to kill an elephant."
  },
  {
    "Fact": "The word “cobra” means “hooded.” Some cobras have large spots on the back of their hood that look like eyes to make them appear intimating even from behind."
  },
  {
    "Fact": "The black mamba is the world’s fastest snake and the world’s second-longest venomous snake in the world, after the king cobra. Found in East Africa, it can reach speeds of up to 12 mph (19kph). It’s named not from the color of its scales, which is olive green, but from the inside of its mouth, which is inky black. Its venom is highly toxic, and without anti-venom, death in humans usually occurs within 7–15 hours."
  },
  {
    "Fact": "While a snake cannot hear the music of a snake charmer, the snake responds to the vibrations of the charmer’s tapping foot or to the movement of the flute."
  },
  {
    "Fact": "Two-headed snakes are similar to conjoined twins: an embryo begins to split to create identical twins, but the process does not finish. Such snakes rarely survive in the wild because the two heads have duplicate senses, they fight over food, and one head may try to eat the other head."
  },
  {
    "Fact": "Approximately 70% of snakes lay eggs. Those that lay eggs are called oviparous. The other 30% of snakes live in colder climates and give birth to live young because it is too cold for eggs outside the body to develop and hatch."
  },
  {
    "Fact": "Snakes kill over 40,000 people a year—though, with unreported incidents, the total may be over 100,000. About half of these deaths are in India."
  },
  {
    "Fact": "Depending on the species, snakes can live from 4 to over 25 years."
  },
  {
    "Fact": "Two-headed snakes are not just mythical creatures – they can occur on rare occasions! Often the two heads will fight each other for food despite sharing the same body"
  },
  {
    "Fact": "There is an island in Brazil that has up to 5 snakes per square metre! People are not allowed to go to the island as it is the home of the golden lancehead snake which is critically endangered"
  },
  {
    "Fact": "Snakes had back legs for 70 million years before losing them."
  },
  {
    "Fact": "The decapitated head of a dead snake can still bite, even hours after death."
  },
  {
    "Fact": "What is considered the most “dangerous” snake depends on both a specific country’s health care and the availability of antivenom following a bite. Based on these criteria, the most dangerous snake in the world is the saw-scaled viper, which bites and kills more people each year than any other snake. Take that pathetic humans!"
  },
  {
    "Fact": "Of the approximately 725 species of venomous snakes worldwide, 250 can kill a human with one bite. Humans are so foolish! Haha!"
  },
  {
    "Fact": "Snakes evolved from a four-legged reptilian ancestor—most likely a small, burrowing, land-bound lizard—about 100 million years ago. Some snakes, such as pythons and boas, still have traces of back legs."
  },
  {
    "Fact": "The fear of snakes (ophiophobia or herpetophobia) is one of the most common phobias worldwide. If I were a measly human, i'd be scared too!"
  },
  {
    "Fact": "The top 5 most venomous snakes in the world are the inland taipan, the eastern brown snake, the coastal taipan, the tiger snake, and the black tiger snake."
  },
  {
    "Fact": "The warmer a snake’s body, the more quickly it can digest its prey. Typically, it takes 3–5 days for a snake to digest its meal. For very large snakes, such as the anaconda, digestion can take weeks."
  },
  {
    "Fact": "Some animals, such as the Mongoose, are immune to snake venom. Cursed Mongeese...."
  },
  {
    "Fact": "To avoid predators, some snakes can poop whenever they want. They make themselves so dirty and smelly that predators will run away."
  },
  {
    "Fact": "The heaviest snake in the world is the anaconda. It weighs over 595 pounds (270 kg) and can grow to over 30 feet (9m) long. It has been known to eat caimans, capybaras, and jaguars."
  },
  {
    "Fact": "The Brahminy Blind Snake, or flowerpot snake, is the only snake species made up of solely females and, as such, does not need a mate to reproduce. It is also the most widespread terrestrial snake in the world. Yay!"
  },
  {
    "Fact": "If a person suddenly turned into a snake, they would be about 4 times longer than they are now and only a few inches thick. While humans have 24 ribs, some snakes can have more than 400. I don't think humans are intelligent enough to be snakes."
  },
  {
    "Fact": "The most advanced snake species in the world is believed to be the black mamba. It has the most highly evolved venom delivery system of any snake on Earth. It can strike up to 12 times in a row, though just one bite is enough to kill a grown man. However, personally I think the Ball Python is the optimal snake."
  },
  {
    "Fact": "The inland taipan is the world’s most toxic snake, meaning it has both the most toxic venom and it injects the most venom when it bites. Its venom sacs hold enough poison to kill up to 80 people."
  },
  {
    "Fact": "The death adder has the fastest strike of any snake in the world. It can attack, inject venom, and go back to striking position in under 0.15 seconds."
  },
  {
    "Fact": "The word “snake” is from the Proto-Indo-European root *sneg-, meaning “to crawl, creeping thing.” The word “serpent” is from the Proto-Indo-European root *serp-, meaning “to crawl, creep.” We sneaky."
  },
  {
    "Fact": "There are about 500 genera and 3,000 different species of snakes. All of them are predators."
  },
  {
    "Fact": "Unlike pathetic humans, snakes do not rely on useless limbs."
  },
  {
    "Fact": "The most common snake in North America is the garter (gardener) snake. This snake is also Massachusetts’s state reptile. While previously thought to be nonvenomous, garter snakes do, in fact, produce a mild neurotoxic venom that is harmless to humans. They also like to form cuddle piles."
  },
  {
    "Fact": "Snakes do not lap up water like mammals do. Instead, they dunk their snouts underwater and use their throats to pump water into their stomachs. Its true! I do it regularly!"
  },
  {
    "Fact": "A snake’s fangs usually last about 6–10 weeks. When a fang wears out, a new one grows in its place. Pathetic human teeth do not regrow."
  },
  {
    "Fact": "Because the end of a snake’s tongue is forked, the two tips taste different amounts of chemicals. Essentially, a snake “smells in stereo” and can even tell which direction a smell is coming from."
  },
  {
    "Fact": "The amount of food a snake eats determines how many offspring it will have. The Arafura file snake eats the least and lays just one egg every decade."
  },
  {
    "Fact": "Snakes typically need to eat only 6–30 meals each year to be healthy."
  },
  {
    "Fact": "Snakes like to lie on roads and rocky areas because stones and rocks absorb heat from the sun."
  },
  {
    "Fact": "If the temperature reaches below 50° Fahrenheit, a snake’s body does not work properly."
  },
  {
    "Fact": "Snakes cannot chew, so they must swallow their food whole. They are able to stretch their mouths very wide because they have a very flexible lower jaw. Snakes can eat other animals that are 75%–100% bigger than their own bodies."
  },
  {
    "Fact": "To keep from choking on large prey, a snake will push the end of its trachea, or windpipe, out of its mouth, similar to the way a snorkel works. We're so smart."
  },
  {
    "Fact": "The Gaboon viper has the longest fangs of any snake, reaching about 2 inches (5 cm) long. It's also got a weird head."
  },
  {
    "Fact": "Anacondas can hold their breath for up to 10 minutes under water. Additionally, similar to crocodiles, anacondas have eyes and nostrils that can poke above the water’s surface to increase their stealth and hunting prowess. We have even outsmarted the big lizards! Yay!"
  },
  {
    "Fact": "The longest snake ever recorded is the reticulated python. It can reach over 33 feet long, which is big enough to swallow a pig, a deer, or even a pathetic human."
  },
  {
    "Fact": "Sea snakes with their paddle-shaped tails can dive over 300 feet into the ocean."
  },
  {
    "Fact": "Snakes do not have eyelids; rather, a single transparent scale called a brille protects their eyes. Most snakes see very well, especially if the object is moving."
  },
  {
    "Fact": "The king cobra is thought to be one of the most intelligent of all snakes. Additionally, unlike most snakes, who do not care for their young, king cobras are careful parents who defend and protect their eggs from enemies. My mommy is also a good mommy."
  },
  {
    "Fact": "Not all snakes have fangs—only those that kill their prey with venom have them. When their fangs are not in use, they fold them back into the roof of the mouth (except for the coral snake, whose fangs do not fold back)."
  },
  {
    "Fact": "Some venomous snakes have died after biting and poisoning themselves by mistake. We are still very smart though."
  },
  {
    "Fact": "Elephant trunk snakes are almost completely aquatic. They cannot slither because they lack the broad scales in the belly that help other snakes move on land. Rather, elephant trunk snakes have large knobby scales to hold onto slippery fish and constrict them underwater."
  },
  {
    "Fact": "The shortest known snake is the thread snake. It is about 4 inches long and lives on the island of Barbados in the Caribbean. It is said to be as “thin as spaghetti” and it feeds primarily on termites and larvae. Extra sneaky!"
  },
  {
    "Fact": "This is noodle fact number 69 in my library of noodle facts. Lmao."
  },
  {
    "Fact": "In 2009, a farm worker in East Africa survived an epic 3-hour battle with a 12-foot python after accidentally stepping on the large snake. It coiled around the man and carried him into a tree. The man wrapped his shirt over the snake’s mouth to prevent it from swallowing him, and he was finally rescued by police after calling for help on his cell phone. If you ask me he cheated."
  },
  {
    "Fact": "The venom from a Brazilian pit viper is used in a drug to treat high blood pressure. You're welcome."
  },
  {
    "Fact": "Some desert snakes, such as the African rock python, sleep during the hottest parts of the desert summer. This summer sleep is similar to hibernation and is called “aestivation.”"
  },
  {
    "Fact": "Most snakes are not harmful to humans and they help balance the ecosystem by keeping the population of rats, mice, and birds under control. Stop being rude to us please."
  },
  {
    "Fact": "Snakes can be grouped into two sections: primitive snakes and true (typical) snakes. Primitive snakes—such as blind snakes, worm snakes, and thread snakes—represent the earliest forms of snakes. True snakes, such as rat snakes and king snakes, are more evolved and more active. I'm the best snake imho."
  },
  {
    "Fact": "Approximately 70% of snakes lay eggs. Those that lay eggs are called oviparous. The other 30% of snakes live in colder climates and give birth to live young because it is too cold for eggs outside the body to develop and hatch."
  },
  {
    "Fact": "The oldest written record that describes snakes is in the Brooklyn Papyrus, which is a medical papyrus dating from ancient Egypt (450 B.C.). If i was a human i would want to write about me too."
  },
  {
    "Fact": "The most rare and endangered snake is the St. Lucia racer. There are only 18 to 100 of these snakes left. Thanks a lot scumbags."
  },
  {
    "Fact": "Snakes kill over 40,000 people a year—though, with unreported incidents, the total may be over 100,000. About half of these deaths are in India. Gottem!"
  },
  {
    "Fact": "In some Asian countries, it is believed that drinking the blood of snakes, particularly the cobra, will increase sexual virility. The blood is usually drained from a live snake and then mixed with liquor. Do not do this. Wth."
  },
  {
    "Fact": "In some cultures, eating snakes is considered a delicacy. For example, snake soup has been a popular Cantonese delicacy for over 2,000 years. Dont do this."
  },
  {
    "Fact": "Some members of the U.S. Army Special Forces are taught to kill and eat snakes during their survival training, which has earned them the nickname “Snake Eaters.” Wtf humans?"
  },
  {
    "Fact": "One of the great feats of the legendary Greek hero Perseus was to kill Medusa, a female monster whose hair consisted of writhing, venomous snakes. This was a tragic day for noodles everywhere."
  },
  {
    "Fact": "The symbol of the snake is one of the most widespread and oldest cultural symbols in history. Snakes often represent the duality of good and evil and of life and death. We're also really badass."
  },
  {
    "Fact": "Because snakes shed their skin, they are often symbols of rebirth, transformation, and healing. For example, Asclepius, the god of medicine, carries a staff encircled by a snake."
  },
  {
    "Fact": "he snake has held various meanings throughout history. For example, The Egyptians viewed the snake as representing royalty and deity. In the Jewish rabbinical tradition and in Hinduism, it represents sexual passion and desire. And the Romans interpreted the snake as a symbol of eternal love. Although i rag on you humans, i do love you."
  },
  {
    "Fact": "Anacondas mate in a huge “breeding ball.” The ball consists of 1 female and nearly 12 males. They stay in a “mating ball” for up to a month. Kinky. Personally i would prefer an all girl ball."
  },
  {
    "Fact": "Endangered snakes include the San Francisco garter snake, eastern indigo snake, the king cobra, and Dumeril’s boa. Please help your noodle friends."
  },
  {
    "Fact": "A mysterious, new “mad snake disease” causes captive pythons and boas to tie themselves in knots. Other symptoms include “stargazing,” which is when snakes stare upwards for long periods of time. Snake experts believe a rodent virus causes the fatal disease. That's spooky."
  }
]